uhnp/src/Reports/ОтчетОЗамещении/ОтчетОЗамещении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОЗамещении</name>
</mdclass:Report>

uhnp/src/InformationRegisters/Заместители/Заместители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Заместители</name>
  <dimensions>
    <name>ЗамещаемыйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заместитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Reports/ОтчетОЗамещении/ObjectModule.bsl
// Возвращает пустую таблицу заместителей.
Функция ИнициализироватьТаблицуЗаместителей()
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции.Колонки.Добавить("Пользователь");
	РезультатФункции.Колонки.Добавить("Родитель");
	РезультатФункции.Колонки.Добавить("ДатаНачала");
	РезультатФункции.Колонки.Добавить("ДатаОкончания");	
	Возврат РезультатФункции;
КонецФункции

// Рекурсивно добавляет в таблицу ТаблицаДобавление заместителей пользователя
// ПользовательВход. В случае наличия заместителя ранее - будет пропущен. 
// Параметр ЗамещениеПользователемВход определяет замещает пользователь сам,
// или является замещаемым. Параметр ГлубинаРекурсииВход защищает от бесконечной рекурсии.
Процедура ДобавитьЗаместителейПользователя(ТаблицаДобавление, ПользовательВход, ЗамещениеПользователемВход, ИсходныйПользовательВход, ГлубинаРекурсииВход = 0)
	Если ГлубинаРекурсииВход > 1000 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ЗамещениеПользователемВход Тогда		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
		|	Заместители.Заместитель КАК Заместитель,
		|	Заместители.ДатаНачала КАК ДатаНачала,
		|	Заместители.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.Заместители КАК Заместители
		|ГДЕ
		|	Заместители.ЗамещаемыйПользователь = &ЗамещаемыйПользователь";
				
		Запрос.УстановитьПараметр("ЗамещаемыйПользователь", ПользовательВход);
	Иначе		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заместители.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
		|	Заместители.Заместитель КАК Заместитель,
		|	Заместители.ДатаНачала КАК ДатаНачала,
		|	Заместители.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.Заместители КАК Заместители
		|ГДЕ
		|	Заместители.Заместитель = &Заместитель";
				
		Запрос.УстановитьПараметр("Заместитель", ПользовательВход);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Заместителей нет. Добавляем детальные записи.
		НоваяСтрока = ТаблицаДобавление.Добавить();
		НоваяСтрока.Пользователь = Справочники.Пользователи.ПустаяСсылка();
		НоваяСтрока.Родитель = ПользовательВход;
	Иначе		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗамещениеПользователемВход Тогда
				ТекЗаместитель = ВыборкаДетальныеЗаписи.Заместитель;
			Иначе
				ТекЗаместитель = ВыборкаДетальныеЗаписи.ЗамещаемыйПользователь;
			КонецЕсли;	
			// Убедимся в необходимости продолжения рекурсии.
			ЗаместительИсходныйПользователь = (ТекЗаместитель = ИсходныйПользовательВход);
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Пользователь", ТекЗаместитель);
			НайденныеСтроки = ТаблицаДобавление.НайтиСтроки(СтруктураОтбора);
			УжеДобавлен = (НайденныеСтроки.Количество() <> 0);
			Если (УжеДобавлен) ИЛИ (ЗаместительИсходныйПользователь) Тогда
							
				// Добавляем детальные записи дерева.
				НоваяСтрока = ТаблицаДобавление.Добавить();
				НоваяСтрока.Пользователь = ТекЗаместитель;				
				НоваяСтрока.Родитель = ПользовательВход;
				НоваяСтрока.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
				НоваяСтрока.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;
								
			Иначе    
			
				// Добавляем найденного пользователя и продолжаем рекурсивный обход.
				НоваяСтрока = ТаблицаДобавление.Добавить();
				НоваяСтрока.Пользователь = ТекЗаместитель;
				НоваяСтрока.Родитель = ПользовательВход;
				НоваяСтрока.ДатаНачала = ВыборкаДетальныеЗаписи.ДатаНачала;
				НоваяСтрока.ДатаОкончания = ВыборкаДетальныеЗаписи.ДатаОкончания;
								
				ДобавитьЗаместителейПользователя(ТаблицаДобавление, ТекЗаместитель, ЗамещениеПользователемВход, ИсходныйПользовательВход, ГлубинаРекурсииВход + 1);
			КонецЕсли; 
		КонецЦикла;
	Конецесли;
КонецПроцедуры

// Возвращает таблицу заместителей пользователя ПользовательВход.
Функция ПолучитьТаблицуЗаместителейПользователя(ПользовательВход)
	// Инициализация.
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции = ИнициализироватьТаблицуЗаместителей();
	// Рекурсивно добавим заместителей пользователя.
	ДобавитьЗаместителейПользователя(РезультатФункции, ПользовательВход, Истина, ПользовательВход);
	РезультатФункции.Сортировать("Пользователь");
	Возврат РезультатФункции;
КонецФункции

// Возвращает таблицу замещаемых пользователя ПользовательВход.
Функция ПолучитьТаблицуЗамещаемыхПользователем(ПользовательВход)
	// Инициализация.
	РезультатФункции = Новый ТаблицаЗначений;
	РезультатФункции = ИнициализироватьТаблицуЗаместителей();
	// Рекурсивно добавим заместителей пользователя.
	ДобавитьЗаместителейПользователя(РезультатФункции, ПользовательВход, Ложь, ПользовательВход);
	Возврат РезультатФункции;
КонецФункции

// Возвращает значение пользовательского параметра с именем ИмяПараметраВход
// в настройках компоновки НастройкиВход.
Функция ПолучитьЗначениеПользовательскогоПараметра(НастройкиВход, ИмяПараметраВход)
	РезультатФункции = Неопределено;
	ЗначенияПараметровКомпоновки = НастройкиВход.ПараметрыДанных;
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(ИмяПараметраВход);
	ПользовательКомпоновка = ЗначенияПараметровКомпоновки.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Если ПользовательКомпоновка <> Неопределено Тогда
		РезультатФункции = ПользовательКомпоновка.Значение;
	Иначе
		РезультатФункции = Неопределено;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Инициализация.
	СтандартнаяОбработка = Ложь;
	Попытка
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		РабочийПользователь = ПолучитьЗначениеПользовательскогоПараметра(Настройки, "Пользователь");
		Если НЕ ЗначениеЗаполнено(РабочийПользователь) Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось получить значение анализируемого пользователя. Операция отменена.'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		Иначе	
			ВНД = Новый Структура;
			// Заместители.
			ТаблицаЗаместителей = ПолучитьТаблицуЗаместителейПользователя(РабочийПользователь);
			ТзСписокЗаместителей = Новый ТаблицаЗначений;
			ТзСписокЗаместителей.Колонки.Добавить("Пользователь");
			ТзСписокЗаместителей.Колонки.Добавить("ДатаНачала");
			ТзСписокЗаместителей.Колонки.Добавить("ДатаОкончания");			
			Для Каждого ТекТаблицаЗаместителей Из ТаблицаЗаместителей Цикл
				НоваяСтрока = ТзСписокЗаместителей.Добавить();
				НоваяСтрока.Пользователь = ТекТаблицаЗаместителей.Пользователь;
				НоваяСтрока.ДатаНачала = ТекТаблицаЗаместителей.ДатаНачала;
				НоваяСтрока.ДатаОкончания = ТекТаблицаЗаместителей.ДатаОкончания;
			КонецЦикла;
			ВНД.Вставить("ТЗ_Заместители", ТаблицаЗаместителей);
			ВНД.Вставить("ТЗ_СписокЗаместителей", ТзСписокЗаместителей);
			// Замещаемые.
			ТаблицаЗамещаемых = ПолучитьТаблицуЗамещаемыхПользователем(РабочийПользователь);
			ТзСписокЗамещаемых = Новый ТаблицаЗначений;
			ТзСписокЗамещаемых.Колонки.Добавить("Пользователь");
			ТзСписокЗамещаемых.Колонки.Добавить("ДатаНачала");
			ТзСписокЗамещаемых.Колонки.Добавить("ДатаОкончания");
			Для Каждого ТекТаблицаЗамещаемых Из ТаблицаЗамещаемых Цикл
				НоваяСтрока = ТзСписокЗамещаемых.Добавить();
				НоваяСтрока.Пользователь = ТекТаблицаЗамещаемых.Пользователь;
				НоваяСтрока.ДатаНачала = ТекТаблицаЗамещаемых.ДатаНачала;
				НоваяСтрока.ДатаОкончания = ТекТаблицаЗамещаемых.ДатаОкончания;
			КонецЦикла;
			КолонкаПользователь = ТаблицаЗамещаемых.Колонки.Найти("Пользователь");
			КолонкаПользователь.Имя = "ПользовательЗамещаемый";
			КолонкаРодитель = ТаблицаЗамещаемых.Колонки.Найти("Родитель");
			КолонкаРодитель.Имя = "РодительЗамещаемый";
			КолонкаПользователь = ТзСписокЗамещаемых.Колонки.Найти("Пользователь");
			КолонкаПользователь.Имя = "ПользовательЗамещаемый";
			ВНД.Вставить("ТЗ_Замещаемые", ТаблицаЗамещаемых);
			ВНД.Вставить("ТЗ_СписокЗамещаемых", ТзСписокЗамещаемых);
			// Вывод СКД.
			ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВНД, ДанныеРасшифровки, Истина);
			ДокументРезультат.Очистить();
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'При выполнении отчета возникли ошибки: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
   Настройки.ВыводитьСуммуВыделенныхЯчеек = Ложь;
КонецПроцедуры
